esp8266/Arduino/libraries/esp8266/examples/HwdtStackDump/hwdt_app_entry.cpp
/*
 * HWDT_UART_SPEED
 *
 * This option alters the UART serial speed used for printing the Hardware WDT
 * reset stack dump. Without this option on an HWDT reset, the existing default
 * speed of 115200 bps will be used. If you are using this default speed, you
 * can skip this option and save on the IRAM space. Note this option only
 * changes the speed while this module is printing.
 *
 * For more confusion on the serial port speed, see "More on crystal differences
 * and data rates" in the comments at the top.
 *
 */
 // #define HWDT_UART_SPEED (19200)
 // #define HWDT_UART_SPEED (74880)
 // #define HWDT_UART_SPEED (115200)
 // #define HWDT_UART_SPEED (230400)


/*
 * HWDT_PRINT_GREETING
 *
 * Prints a simple introduction to let you know this tool is active and in the
 * build. At power-on, this may not be viewable on some devices. The crystal
 * has to be 40Mhz for this to work w/o using the HWDT_UART_SPEED option above.
 * May not be worth the cost in IRAM.
 *
 * EDIT: There is something different in the UART setup after a flash upload. I
 * am unable to print using the same code that works for Power-on and an EXT_RST
 * at any other time. After the SDK has run a 2nd EXT_RST will show the greeting
 * message.
 *
 * EDIT2: Seems to work better now. Placed delays around calls to
 * uart_div_modify(). Leave these comments until I have more experience with
 * this change.
 *
 * EDIT3: The delay before the uart_div_modify() has been replaced with a wait
 * till FIFO empty loop. I now believe the lost greeting message after an
 * esptool firmware update, has to do with the transition period between the
 * tool performing hardware reset and exiting, then the serial monitor
 * re-engaging. This is not an issue that needs to be addressed here.
 */
 // #define HWDT_PRINT_GREETING


/*
 * ROM_STACK_SIZE
 *
 * There are four sections of code starting just before 0x40000000, that share
 * the same stack space.
 *   1) The Boot ROM (uses around 640 bytes)
 *   2) The Bootloader, eboot.elf (uses around 720 bytes.)
 *   3) `app_entry_redefinable()` just before it starts the SDK.
 *   4) The NONOS SDK and optionally the Core when the extra 4K option is selected.
 *
 * To preserve the sketch stack data for a stack dump, I define three separate
 * stacks:
 *   1) Boot ROM and eboot
 *   2) this stack dump code
 *   3) SDK, Core, and Sketch
 *
 * With this, we can recover a complete stack trace of our failed sketch. To be
 * safe, I am leaving this at 1024; however, I think there is room to lower it
 * without loss of information.
 */
#ifndef ROM_STACK_SIZE
#define ROM_STACK_SIZE (1024)
#endif


/*
 * HWDT_INFO
 *
 * Gather some information on ROM and bootloader combined, sys, and cont stack
 * usage. If you are missing the include file for this structure, you can
 * copy-paste from the embedded version of the .h below.
 *
 */
 #define HWDT_INFO


/*
 * ROM_STACK_DUMP
 *
 * Dump the stack contents of the ROM Stack area. This gives us a visual of the
 * stack usage. Probably not of value, beyond developing this tool.
 *
 * To see printing, you may need to use this option with HWDT_UART_SPEED.
 */
 // #define ROM_STACK_DUMP


/*
 * HWDT_IF_METHOD_RESET_REASON
 *
 * "If" statement or "switch" method to implement, the reset reason logic. Both
 * can be made smaller by removing confirmation checks.
 *
 * Checks are performed when DEBUG_HWDT_DEBUG_RESET_REASON has been defined.
 *
 * EDIT: I should settle on one or the other; however, new issues continue to
 * pop up on determining reset reason. I'll wait until later and pick one.
 *
 #define DEBUG_HWDT_DEBUG_RESET_REASON
 */
 #define HWDT_IF_METHOD_RESET_REASON

/*____________________________________________________________________________*/
/*                                                                            */
/*                     End of Configuration Options                           */
/*____________________________________________________________________________*/


#ifdef DEBUG_HWDT

#include <c_types.h>
#include "cont.h"
#include "coredecls.h"
#include <core_esp8266_features.h>
#include <esp8266_undocumented.h>
#include <esp8266_peri.h>
#include <uart.h>
#include <pgmspace.h>

extern "C" {
#include <user_interface.h>
extern void call_user_start();
extern uint32_t rtc_get_reset_reason(void);

uint32_t __zero_return() {
  return 0;
}
// extern void stack_thunk_dump_stack();
extern uint32_t stack_thunk_get_refcnt() __attribute__((weak, alias("__zero_return")));
extern uint32_t stack_thunk_get_stack_top() __attribute__((weak, alias("__zero_return")));
extern uint32_t stack_thunk_get_stack_bot() __attribute__((weak, alias("__zero_return")));

}

// #define DEBUG_HWDT_DEBUG
// #define USE_IRAM

#ifdef USE_IRAM
#undef USE_IRAM
#define USE_IRAM 1
#define IRAM_MAYBE ICACHE_RAM_ATTR

#else
#undef USE_IRAM
#define IRAM_MAYBE
#endif

#define STATIC static __attribute__((noinline))
// #define STATIC

#ifdef DEBUG_HWDT_DEBUG
/*
 * We have two copies of hwdt_info_t. Verify internal and external structures
 * match.
 *
 * This duplication is done so that in most cases, a simple/quick add one file
 * to a sketch folder is enough to debug.
 *
 * Only if additional internal information is needed, would this include be
 * added. Since we have two copies, a static_assert is used to verify that at
 * least the the size of the two structures are the same.
 */
#include "hwdt_app_entry.h"
#endif

/*
 * Verify that the internal and external structure definitions match.
 */
#ifdef HWDT_STACK_DUMP_H
#define hwdt_info_t LOCAL_HWDT_INFO_T
#define hwdt_info_ LOCAL_HWDT_INFO_
#define hwdt_info LOCAL_HWDT_INFO
#define HWDT_VERIFY_HWDT_INFO
#endif

/*
 * If you are using the hwdt_info_t structure, and are missing the include file.
 * Copy-paste the include block below into its respective filename.
 */

/*____________________________________________________________________________*/
/*                                                                            */
/*        Start of copy-paste block to create "hwdt_app_entry.h"              */
/*____________________________________________________________________________*/
#if !defined(HWDT_STACK_DUMP_H) || defined(HWDT_VERIFY_HWDT_INFO)
#define HWDT_STACK_DUMP_H

typedef struct hwdt_info_ {
    uint32_t rom;
    uint32_t sys;
    uint32_t cont;
    uint32_t bearssl;
    uint32_t rom_api_reason;
    uint32_t rtc_sys_reason;
    uint32_t reset_reason;
    uint32_t cont_integrity;
    bool g_pcont_valid;
} hwdt_info_t;

