esp8266/Arduino/libraries/esp8266/examples/HwdtStackDump/hwdt_app_entry.cpp
#define UART_CLKDIV_MASK 0x000FFFFFUL

void adjust_uart_speed(uint32_t uart_divisor) {
    /*
     * Take care to let serial data in the FIFO finish before changing UART
     * speed. Then after changing speeds, let the uart clock generator
     * stablilize, and let the remote receiver come to an idle state before
     * continuing.
     *
     * Load a Rubout character for the final charcter shifting out to stop
     * the last charcter from getting crunched during the speed change.
     *
     * The thinking is if the speed changes while shifting out, as long as the
     * start bit gets out before the change. The change will not be noticed
     * since all ones will look like the serial line idle state. And for text
     * displaying, received rubout characters should be discarded. At least that
     * was true 40 years ago.
     *
     * EDIT: In today's world, it appears the rubout character is no longer
     * discarded. However, I think we are better off using it since it allows
     * for creating a deterministic last character that will not clear the
     * screen or something worse. And it is simpler than the other option of
     * calculating and waiting for a character time to pass.
     *
     * These adjustments appear to resolve the lost data problem that occurs
     * when printing after a flash upload using esptool.
     */
    ets_putc('\xFF');
    ETS_FLUSH(0);
    real_uart_div_modify(0, uart_divisor);
    ets_delay_us(150);
}

STATIC uint32_t IRAM_MAYBE set_uart_speed(const uint32_t uart_no, const uint32_t new_speed) {

    uint32_t uart_divisor = USD(uart_no) & UART_CLKDIV_MASK;
    /*
     * No adjustments are needed on most reboots, etc.
     *
     * The UART clock is independent of the CPU Speed. (ie. 80MHz, 160MHz)
     * UART_CLK_FREQ is used in user_init, and ESP8266_CLOCK is used in
     * uart.h. Both are defined to be 80000000.
     */
#if (1 < F_CRYSTAL)
    constexpr uint32_t crystal_freq = F_CRYSTAL;
#else
    constexpr uint32_t crystal_freq = 26000000;
#endif
    uint32_t master_freq = UART_CLK_FREQ;
    if (REASON_DEFAULT_RST       == hwdt_info.reset_reason ||
        REASON_EXT_SYS_RST       == hwdt_info.reset_reason ||
        REASON_DEEP_SLEEP_AWAKE  == hwdt_info.reset_reason) {
        /*
         * At this time, with power on boot or EXT_RST, the CPU Frequency
         * calibration has not happened. Thus for a 26MHz Xtal, the CPU clock is
         * running at 52MHz. Tweak UART speed here, so printing works. To avoid
         * confusion on exit, we later restore the divisor.
         */
        master_freq = crystal_freq * 2;
    }

    uint32_t new_uart_divisor = master_freq / new_speed;

    if (UART_CLKDIV_MASK < new_uart_divisor ||
        2 > new_uart_divisor ||
        new_uart_divisor == uart_divisor) {
        uart_divisor = 0;   // used to indicate no change

    } else {
        adjust_uart_speed(new_uart_divisor);
    }

#if defined(DEBUG_HWDT_DEBUG)
    ETS_PRINTF("\n\nreal_uart_div_modify(0, %u / %u);\n", master_freq, new_speed);
    ETS_PRINTF("F_CRYSTAL = %u\n", crystal_freq);
    ETS_PRINTF("old uart_divisor = %u\n", uart_divisor);
    ETS_PRINTF("new uart_divisor = %u\n", new_uart_divisor);
    ETS_PRINTF("master_freq = %u\n", master_freq);
#endif

    return uart_divisor;
}
#endif

/*
 *
 *
 *
 *
 */
STATIC void IRAM_MAYBE handle_hwdt(void) {

    ets_memset(&hwdt_info, 0, sizeof(hwdt_info));
    check_g_pcont_validity();

    bool power_on = false;
    bool hwdt_reset = false;
    get_reset_reason(&power_on, &hwdt_reset);

#ifdef HWDT_UART_SPEED
    const uint32_t uart_divisor = set_uart_speed(0, HWDT_UART_SPEED);
#endif
#if defined(DEBUG_HWDT_DEBUG)
    ETS_PRINTF("Basic boot reason: %s\n", (power_on) ? "Power-on" : "Reboot");
    ETS_PRINTF("RTC_SYS Reset Reason = %u\n", hwdt_info.rtc_sys_reason);
    ETS_PRINTF("ROM API Reset Reason = %u\n", hwdt_info.rom_api_reason);
    ETS_PRINTF("HWDT Reset Reason = %u\n\n", hwdt_info.reset_reason);
#endif
#if defined(DEBUG_HWDT_DEBUG_RESET_REASON)
    if (REASON_EXT_SYS_RST < hwdt_info.reset_reason) {
        ETS_PRINTF("Reset reason confirmation failed!\n");
        ETS_PRINTF("  RTC_SYS Reset Reason = %u\n", hwdt_info.rtc_sys_reason);
        ETS_PRINTF("  ROM API Reset Reason = %u\n", hwdt_info.rom_api_reason);
    }
#endif
    /*
     * With a few exceptions, DRAM data remains valid after a reset.
     *
     * Check for "cont" stack consistency.
     * The contents of DRAM are not expected to be valid after a:
     *   1) flash update (OTA or serial)
     *   2) power-on
     *   3) deep sleep
     * Additionally, g_pcont is expected to be invalid after these events.
     *
     * When g_pcont is valid, we expect these checks to be valid. I am not sure
     * what to do when they are not. An error that could lead to a crash is
     * corrected. We currently continue and print the stack dump. This assumes
     * something is better than nothing.
     */
    if (!power_on && hwdt_info.g_pcont_valid) {
        uint32_t cont_integrity = 0;
        if (g_pcont->stack_guard1 != CONT_STACKGUARD) {
          cont_integrity |= 0x0001;
        }
        if (g_pcont->stack_guard2 != CONT_STACKGUARD) {
          cont_integrity |= 0x0020;
        }
        if (g_pcont->stack_end != (g_pcont->stack + (sizeof(g_pcont->stack) / 4))) {
          cont_integrity |= 0x0300;
          // Fix ending so we don't crash
          g_pcont->stack_end = (g_pcont->stack + (sizeof(g_pcont->stack) / 4));
        }
        if (g_pcont->struct_start != (unsigned*) g_pcont) {
          cont_integrity |= 0x4000;
        }
        hwdt_info.cont_integrity = cont_integrity;

#if defined(DEBUG_HWDT_NO4KEXTRA) || defined(HWDT_INFO)
        const uint32_t *ctx_cont_ptr = skip_stackguard(g_pcont->stack, g_pcont->stack_end, CONT_STACKGUARD);
        hwdt_info.cont = (uintptr_t)g_pcont->stack_end - (uintptr_t)ctx_cont_ptr;
#endif

        const uint32_t *ctx_sys_ptr = skip_stackguard(sys_stack, rom_stack, CONT_STACKGUARD);
        hwdt_info.sys = (uintptr_t)rom_stack - (uintptr_t)ctx_sys_ptr;

#ifndef USE_IRAM
        const uint32_t *bearssl_stack_top = NULL;
        const uint32_t *ctx_bearssl_ptr = NULL;
        if (stack_thunk_get_refcnt()) {
            bearssl_stack_top = (const uint32_t *)stack_thunk_get_stack_top();
            ctx_bearssl_ptr = skip_stackguard((const uint32_t *)stack_thunk_get_stack_bot(), bearssl_stack_top, 0xdeadbeef);
            hwdt_info.bearssl = (uintptr_t)bearssl_stack_top - (uintptr_t)ctx_bearssl_ptr;
        }
#endif

        if (hwdt_reset) {
            ETS_PRINTF("\n\nHardware WDT reset\n");
#ifndef USE_IRAM
            if (bearssl_stack_top) {
                /* Print context bearssl */
                print_stack((uintptr_t)ctx_bearssl_ptr, (uintptr_t)bearssl_stack_top, PRINT_STACK::BEARSSL);
            }
#endif
            /* Print context SYS */
            print_stack((uintptr_t)ctx_sys_ptr, (uintptr_t)rom_stack, PRINT_STACK::SYS);

