esp8266/Arduino/libraries/esp8266/examples/HwdtStackDump/hwdt_app_entry.cpp
#ifdef DEBUG_HWDT_NO4KEXTRA
            /* Print separate ctx: cont stack */
            print_stack((uintptr_t)ctx_cont_ptr, (uintptr_t)g_pcont->stack_end, PRINT_STACK::CONT);
#endif
            if (hwdt_info.cont_integrity) {
                ETS_PRINTF("\nCaution, the stack is possibly corrupt integrity checks did not pass.\n\n");
            }
        }
    }

    /*
     *  Fill the SDK stack area with CONT_STACKGUARD so we can detect and
     *  skip the unused section of the stack when printing a Stack Dump.
     */
    {
        size_t this_mutch = (uintptr_t)rom_stack - (uintptr_t)sys_stack;
        this_mutch /= sizeof(uint32_t);
        for (size_t i = 0; i < this_mutch; i++) {
            sys_stack[i] = CONT_STACKGUARD;
        }
    }

#if defined(HWDT_INFO) || defined(ROM_STACK_DUMP)
    /*
     *  Reports on rom_stack usage by ROM and eboot.
     *  Used to confirm ROM_STACK_SIZE is large enough.
     */
    {
        const uint32_t *ctx_rom_ptr = skip_stackguard(rom_stack, rom_stack_first, CONT_STACKGUARD);
        hwdt_info.rom = (uintptr_t)rom_stack_first - (uintptr_t)ctx_rom_ptr;
#if defined(ROM_STACK_DUMP)
        print_stack((uintptr_t)ctx_rom_ptr, (uintptr_t)rom_stack_first, PRINT_STACK::ROM);
#endif
    }
#endif

#if defined(HWDT_PRINT_GREETING)
    ETS_PRINTF("\n\nHardware WDT Stack Dump - enabled\n\n");
#else
    ETS_PRINTF("\n\n");
#endif

#ifdef HWDT_UART_SPEED
    if (uart_divisor) {
        adjust_uart_speed(uart_divisor);
    }
#endif
}

/*
 * Using Cache_Read_Enable/Cache_Read_Disable to reduce IRAM usage. Moved
 * strings and most functions to flash. At this phase of the startup, "C++" has
 * not initialized. So, we needed a local "C" function to handle printing from
 * flash. For this, I grabbed a copy of umm_info_safe_printf_P.
 *
 * This reduced IRAM usage by ~1K and DRAM ~200 bytes.
 *
 * Inspiration for using Cache_Read_Enable came from reviewing rboot, zboot, and
 * https://richard.burtons.org/2015/06/12/esp8266-cache_read_enable/.
 * Additional insight can be gleemed from reviewing the ESP8266_RTOS_SDK.
 * (eg. ../components/bootloader_support/src/bootloader_utility.c)
 */
#define ICACHE_SIZE_32 1
#define ICACHE_SIZE_16 0

extern "C" void Cache_Read_Disable(void);
extern "C" void Cache_Read_Enable(uint8_t map, uint8_t p, uint8_t v);

void ICACHE_RAM_ATTR app_entry_start(void) {

    handle_hwdt();

#ifdef DEBUG_HWDT_NO4KEXTRA
    /*
     *  Continuation context is in BSS.
     */
    g_pcont = &g_cont;
#else
    /*
     *  The continuation context is on the stack just after the reserved space
     *  for the ROM/eboot stack and before the SYS stack begins.
     *  All computations were done at top, save pointer to it now.
     */
    g_pcont = cont_stack;
#endif
    /*
     *  Use new calculated SYS stack from top.
     *  Call the entry point of the SDK code.
     */
    asm volatile ("" ::: "memory");

#ifndef USE_IRAM
    asm volatile ("callx0 %0\n\t" ::
                  "r" (Cache_Read_Disable) : "memory");
#endif

    asm volatile ("mov.n a1, %0\n\t"
                  "movi a0, 0x4000044c\n\t"     /* Should never return; however, set return to Boot ROM Breakpoint */
                  "jx %1\n\t" ::
                  "r" (sys_stack_first), "r" (call_user_start):
                  "a0", "a1");

    __builtin_unreachable();
}

void ICACHE_RAM_ATTR app_entry_redefinable(void) {
    /*
     * There are 4 sections of code that share the stack starting near
     * 0x40000000.
     *   1) The Boot ROM (uses around 640 bytes)
     *   2) The Bootloader, eboot.elf (last seen using 720 bytes.)
     *   3) `app_entry_redefinable()` just before it starts the SDK.
     *   4) The NONOS SDK, optionally the Core when the extra 4K option is
     *      selected.
     *
     * Use the ROM BSS zeroed out memory as the home for our temporary stack.
     * This way no additional information will be lost. That will remove this
     * tool from the list of possible concerns for stack overwrite.
     *
     */
    asm volatile ("movi a1, 0x3fffeb30\n\t" ::: "a1");

#ifndef USE_IRAM
    // Enable cache over flash
    asm volatile ("movi.n a2, 0\n\t"
                  "movi.n a3, 0\n\t"
                  "movi.n a4, 0\n\t"    // 0 == ICACHE_SIZE_16
                  "callx0 %0\n\t" ::
                  "r" (Cache_Read_Enable):
                  "a2", "a3", "a4", "memory");
#endif

    asm volatile ("j app_entry_start" ::);

    /*
     * Keep this function with just asm seems to help avoid a stack frame being
     * created for this function and things getting really confused.
     */

    __builtin_unreachable();
}


#if defined(HWDT_INFO) || defined(ROM_STACK_DUMP)
void preinit(void) {
    /*
     * Fill the rom_stack while it is not actively being used.
     *
     * I am thinking that during the time the sketch is running this block of
     * memory could be used for a scratch buffer.
     */
    for (size_t i = 0; i < g_rom_stack_A16_sz/sizeof(uint32_t); i++) {
        g_rom_stack[i] = CONT_STACKGUARD;
    }
}
#endif

};

#else
void enable_debug_hwdt_at_link_time(void) {
}
#endif // end of #ifdef DEBUG_HWDT
